# 1. Берем полную версию Python (в ней есть DNS и сертификаты)
FROM python:3.11

# 2. Создаем пользователя с ID 1000 (КРИТИЧНО ВАЖНО для доступа к сети)
RUN useradd -m -u 1000 user

# 3. Создаем папку приложения и отдаем её пользователю
WORKDIR /app

# 4. Копируем зависимости
COPY requirements.txt .

# 5. Устанавливаем библиотеки (глобально, чтобы были доступны всем)
RUN pip install --no-cache-dir -r requirements.txt

# 6. Копируем код и сразу меняем владельца на 'user'
COPY --chown=user . .

# 7. Переключаемся на пользователя 1000 (Включает интернет)
USER user

# 8. Запускаем
CMD ["python", "bot.py"]